       01  DFHCOMMAREA.
           03  REQUEST-TYPE                 PIC X.
           03  RET-CODE                     PIC XX.
           03  FUND-ID                      PIC X(8).
           03  FUND-NAME                    PIC X(50).
           03  FUND-RATING                  PIC X.
           03  FUND-PRICE                   PIC X(15).

